#ifndef C_MAIN_WINDOW_H
#define C_MAIN_WINDOW_H

//****************************************************************************************************
// ласс главного окна программы
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <QMainWindow>
#include <stdint.h>
#include <memory>
#include "../Video/ivideo.h"
#include "../Game/cgame.h"

//****************************************************************************************************
//пространства имЄн
//****************************************************************************************************

namespace Ui
{
 class CMainWindow;
}

//****************************************************************************************************
//макроопределени€
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объ€влени€
//****************************************************************************************************

//****************************************************************************************************
// ласс главного окна программы
//****************************************************************************************************
class CMainWindow:public QMainWindow
{
 Q_OBJECT
 public:
  //-перечислени€---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
  static const uint32_t TIMER_INTERVAL_MS=1;//интервал срабатывани€ таймера, мс
 private:
  //-переменные-----------------------------------------------------------------------------------------
  Ui::CMainWindow *ui;
  QImage qImage;//выводимое изображение
  int32_t TimerId;//идентификатор таймера
  bool Enabled;//разрешена ли работа игры
  std::unique_ptr<IVideo> iVideo_Ptr;//указатель на класс видеоэкрана
  std::unique_ptr<CGame> cGame_Ptr;//указатель на класс игры
  //состо€ние клавиш
  bool Left;
  bool Right;
  bool Up;
  bool Down;
  bool Fire;
 public:
  //-конструктор----------------------------------------------------------------------------------------
  explicit CMainWindow(QWidget *parent=0);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CMainWindow();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
 private:
  //-закрытые функции-----------------------------------------------------------------------------------
  void timerEvent(QTimerEvent *qTimerEvent_Ptr);//обработчик таймера
  void paintEvent(QPaintEvent *qPaintEvent_Ptr);//обработчик событи€ перерисовки
  void keyPressEvent(QKeyEvent *pe);//обработчик нажати€ клавиши
  void keyReleaseEvent(QKeyEvent *event);//обработчик отпускани€ клавиши
 private slots:
};

#endif

